<a href="https://colab.research.google.com/github/dianakang/DIANA_Pandas/blob/master/Do_it_Pandas_10_apply_%EB%A9%94%EC%84%9C%EB%93%9C_%ED%99%9C%EC%9A%A9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 목차

*   10.1. apply 메서드 활용

*   10.2. apply 메서드 사용하기 - 기초
  *   10.2.1. 시리즈와 apply 메서드
  *   10.2.2. 데이터프레임과 apply 메서드

*   10.3. apply 메서드 사용하기 - 고급
   *   10.3.1. 열 방향 데이터 처리하기
   *   10.3.2. 행 방향 데이터 처리하기

---

# 10. apply 메서드 활용

apply 메서드는 사용자가 작성한 함수를 한 번에 데이터프레임의 각 행과 열에 적용하여 실행할 수 있게 해주는 메서드이다.

즉, 함수를 브로드캐스팅해야 하는 경우에 apply 메서드를 사용한다.

물론 apply 메서드를 사용하지 않아도 for문을 이용하면 각 데이터에 함수를 적용할 수 있다. 
하지만 대용량의 데이터를 처리할 때는 apply 메서드가 for문보다 더 빠르기 때문에 apply 메서드의 사용법은 반드시 알아두어야 한다.

## 10.1. 간단한 함수 만들기

제곱 함수와 n 제곱 함수를 한 번 만들어보자.

In [1]:
# 제곱 함수 만들기
def my_sq(x):
  return x ** 2

# n 제곱 함수 만들기
def my_exp(x,n):
  return x ** n

print(my_sq(4))
print(my_exp(2,4))

16
16

## 10.2. apply 메서드 사용하기 - 기초

다음 실습을 통해 apply 메서드의 사용법을 알아보자.

apply 메서드로 브로드캐스팅한 결과가 올바른 값인지 확인하기 위해 시리즈, 데이터프레임의 기초 연산 결과와 비교하며 실습을 진행하겠다.

### 10.2.1. 시리즈와 apply 메서드

In [2]:
# 데이터프레임 생성
import pandas as pd

df = pd.DataFrame({'a': [10,20,30], 'b': [20,30,40]})
df

    a   b
0  10  20
1  20  30
2  30  40

다음은 앞에서 만든 제곱 함수(my_exp)를 사용하기 전에 a열을 제곱하여 얻은 결과이다. 

이 결과값과 apply 메서드를 적용한 결과값을 비교해보자.

In [3]:
# a열 제곱하기
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

다음은 apply 메서드에 제곱 함수의 이름(my_sq)을 전달하여 시리즈의 모든 데이터에 제곱 함수를 적용한 것이다.

이때 apply 메서드에 전달하는 함수(my_sq)가 1개의 인자를 받도록 구성되어 있다면 인자값을 생략해야 한다. 

그러면 2개의 인자를 전달해야 할 경우에는 어떻게 해야할까?

In [4]:
sq = df['a'].apply(my_sq)
sq

0    100
1    400
2    900
Name: a, dtype: int64

이제 2개의 인자를 전달받아야 하는 n 제곱 함수(my_exp)와 apply 메서드를 함께 사용해보겠다. 

apply 메서드의 첫 번째 인자에는 n 제곱 함수의 이름(my_exp)을 전달하고, 두 번째 인자에는 n 제곱 함수의 두 번째 인자(n)을 전달한다.

In [5]:
ex = df['a'].apply(my_exp, n=2)
print(ex)


ex = df['a'].apply(my_exp, n=3)
print(ex)

0    100
1    400
2    900
Name: a, dtype: int64
0     1000
1     8000
2    27000
Name: a, dtype: int64

### 10.2.2. 데이터프레임과 apply 메서드

In [6]:
# 데이터프레임 생성
import pandas as pd

df = pd.DataFrame({'a': [10,20,30], 'b': [20,30,40]})
df

    a   b
0  10  20
1  20  30
2  30  40



이번엔 새로운 함수를 한 번 만들어보자. 사용할 함수는 1개의 값을 전달받아 출력하는 함수이다.

In [7]:
# 새로운 함수 생성
def print_me(x):
  print(x)

데이터프레임에 함수를 적용해야 하기 때문에 함수를 열 방향으로 적용할지, 행 방향으로 적용할지 정해야 한다. 

axis 인자값을 0이나 1로 지정하면 함수를 열 또는 행 방향으로 적용할 수 있다. 

(만약 axis 값을 지정하지 않으면 열 방향(0)으로 함수가 적용된다.)

In [8]:
print(df.apply(print_me, axis=0))
print("-"*100)

print(df['a'])
print("-"*100)
print(df['b'])

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    None
b    None
dtype: object
----------------------------------------------------------------------------------------------------
0    10
1    20
2    30
Name: a, dtype: int64
----------------------------------------------------------------------------------------------------
0    20
1    30
2    40
Name: b, dtype: int64

이번에는 3개의 인자를 입력받아 평균을 계산하는 함수를 사용해보겠다.

In [9]:
def avg_3(x, y, z):
  return (x+y+z) / 3

그런데 avg_3 함수를 apply 메서드에 전달하면 'avg_3 함수는 3개의 인자값을 필요로 하는 함수인데 1개의 인자값만 입력받았다'는 오류 메시지가 출력된다. 

즉, avg_3 함수에 열 단위 데이터(df['a'] 또는 df['b'])가 전달되었고, 이 값을 avg_3 함수에서 1개의 인자로 인식한 것이다.

따라서 avg_3 함수가 *'열 단위로 데이터를 처리할 수 있도록 수정'*해야한다.

In [10]:
# df.apply(avg_3) -> 오류 메시지 출력

다음은 avg_3 함수가 열 단위로 데이터를 처리할 수 있도록 개선한 avg_3_apply 함수이다. 개선한 함수를 apply 메서드에 적용하면 잘 동작하는 것을 알 수 있다.

In [11]:
# 열 방향 데이터 처리 - col
def avg_3_apply(col):
  x = col[0]
  y = col[1]
  z = col[2]
  return (x+y+z) / 3

print(df.apply(avg_3_apply))

a    20.0
b    30.0
dtype: float64

앞의 과정에서는 데이터프레임의 행 개수가 3이라는 것을 알고 있다는 전제하에 avg_3_apply 함수를 작성했다. 

하지만 일반적으로는 for문을 이용하여 아래와 같이 작성한다.

In [12]:
def avg_3_apply(col):
  sum = 0
  for item in col:
    sum += item
  return sum / df.shape[0]

위의 함수를 응용하면 행 방향으로 데이터를 처리하는 함수도 만들 수 있다.

마지막 return문의 df.shape[0]을 df.shape[1]로 바꾸면 된다.

In [13]:
# 행 방향 데이터 처리 - row
def avg_2_apply(row):
  sum = 0
  for item in row:
    sum += item
  return sum / df.shape[1]

print(df.apply(avg_2_apply, axis=1))

0    15.0
1    25.0
2    35.0
dtype: float64

## 10.3. apply 메서드 사용하기 - 고급

이번에는 조금 더 큰 데이터를 사용하여 실습을 진행해보겠다. 이번에 사용할 데이터는 seaborn 라이브러리의 titanic 데이터 집합이다.

### 10.3.1. 열 방향 데이터 처리하기

In [14]:
# 데이터 불러오기
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [15]:
# 데이터 정보 확인하기
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

다음은 **누락값의 개수를 반환하는 count_missing 함수**이다. 판다스의 isnull 메서드에 데이터프레임을 전달하면 누락값의 유무에 따라 True, False를 적용한 데이터프레임이 만들어진다. 이 값을 넘파이의 sum 메서드에 전달하면 누락값의 개수를 구할 수 있다.

In [16]:
import numpy as np

def count_missing(vec):
  null_vec = pd.isnull(vec)
  null_count = np.sum(null_vec)
  return null_count

다음은 apply 메서드에 count_missing 함수를 전달하여 얻은 결과이다.

In [17]:
# 누락값 개수 확인
cmis_col = titanic.apply(count_missing)   ## 열 = col
cmis_col

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

다음은 누락값의 비율을 계산하는 prop_missing 함수이다. count_missing 함수를 이용해 데이터프레임의 누락값 개수를 구하고, size 속성을 이용해 데이터프레임의 전체 데이터 수를 구하여 나누면 누락값의 비율을 계산할 수 있다.

In [18]:
# 누락값 비율 계산 함수 생성
def prop_missing(vec):
  num = count_missing(vec)  ## count_missing() -> 누락값 개수 구하는 메서드
  dem = vec.size     ## .size -> 전체 데이터 수 구하는 속성
  return num / dem   ## 누락값 비율 계산

다음은 apply 메서드에 prop_missing 함수를 적용한 것이다.

In [19]:
# 누락값 비율 확인
pmis_col = titanic.apply(prop_missing)
pmis_col

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

위에서 사용했던 prop_missing 함수를 이용하면 **누락값이 아닌 데이터의 비율**도 구할 수 있다. 

= (전체 비율) - (누락값 비율)

같은 방법으로 apply 메서드에 prop_complete 함수를 전달하여 결과를 확인해보자.

In [20]:
# 누락값이 아닌 데이터의 비율 계산 함수 생성
def prop_complete(vec):
  return 1 - prop_missing(vec)

In [22]:
# 누락값이 아닌 데이터의 비율 확인
nmis_col = titanic.apply(prop_complete)
print(nmis_col)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

### 10.3.2. 행 방향 데이터 처리하기

이번에는 행 방향으로 데이터를 처리해보자. 다음은 **axis를 1로 설정**하여 앞에서 만든 count_missing, prop_missing, prop_complete 함수를 행 방향으로 적용하여 실행한 것이다. 

각 행의 누락값과 누락값의 비율, 누락값이 아닌 값의 비율을 잘 계산하고 있다는 것을 알 수 있다.

In [23]:
cmis_row = titanic.apply(count_missing, axis=1)    ## 행 = row
pmis_row = titanic.apply(prop_missing, axis=1)
pcom_row = titanic.apply(prop_missing, axis=1)

print(cmis_row.head())
print("-"*100)
print(pmis_row.head())
print("-"*100)
print(pcom_row.head())

0    1
1    0
2    1
3    0
4    1
dtype: int64
----------------------------------------------------------------------------------------------------
0    0.066667
1    0.000000
2    0.066667
3    0.000000
4    0.066667
dtype: float64
----------------------------------------------------------------------------------------------------
0    0.066667
1    0.000000
2    0.066667
3    0.000000
4    0.066667
dtype: float64

다음은 누락값의 개수를 구하여 titanic 데이터프레임에 추가한 것이다. 데이터프레임에 num_missing 열이 추가된 것을 알 수 있다.

In [24]:
# 누락값의 개수(num_missing) 열 추가
titanic['num_missing'] = titanic.apply(count_missing, axis=1)
titanic.head()

   survived  pclass     sex   age  ...  embark_town  alive  alone num_missing
0         0       3    male  22.0  ...  Southampton     no  False           1
1         1       1  female  38.0  ...    Cherbourg    yes  False           0
2         1       3  female  26.0  ...  Southampton    yes   True           1
3         1       1  female  35.0  ...  Southampton    yes  False           0
4         0       3    male  35.0  ...  Southampton     no   True           1

[5 rows x 16 columns]

위의 과정에서 누락값이 있는 데이터를 데이터프레임에 추가했기 때문에 **누락값이 있는 데이터만을 모아서 볼 수도 있다.**

다음은 누락값이 2개 이상인 데이터를 추출한 것이다.

In [25]:
# 누락값이 2개 이상인 데이터 추출
titanic.loc[titanic.num_missing > 1, :].sample(10)

     survived  pclass     sex  age  ...  embark_town  alive  alone num_missing
411         0       3    male  NaN  ...   Queenstown     no   True           2
589         0       3    male  NaN  ...  Southampton     no   True           2
29          0       3    male  NaN  ...  Southampton     no   True           2
790         0       3    male  NaN  ...   Queenstown     no   True           2
863         0       3  female  NaN  ...  Southampton     no  False           2
697         1       3  female  NaN  ...   Queenstown    yes   True           2
653         1       3  female  NaN  ...   Queenstown    yes   True           2
466         0       2    male  NaN  ...  Southampton     no   True           2
563         0       3    male  NaN  ...  Southampton     no   True           2
692         1       3    male  NaN  ...  Southampton    yes   True           2

[10 rows x 16 columns]

In [26]:
titanic.loc[titanic.num_missing >= 2, :].sample(10)

     survived  pclass     sex   age  ...  embark_town  alive  alone num_missing
613         0       3    male   NaN  ...   Queenstown     no   True           2
126         0       3    male   NaN  ...   Queenstown     no   True           2
101         0       3    male   NaN  ...  Southampton     no   True           2
829         1       1  female  62.0  ...          NaN    yes   True           2
335         0       3    male   NaN  ...  Southampton     no   True           2
878         0       3    male   NaN  ...  Southampton     no   True           2
692         1       3    male   NaN  ...  Southampton    yes   True           2
32          1       3  female   NaN  ...   Queenstown    yes   True           2
154         0       3    male   NaN  ...  Southampton     no   True           2
773         0       3    male   NaN  ...    Cherbourg     no   True           2

[10 rows x 16 columns]



---


이번 10장에서는 여러 가지 실습을 통해 apply 메서드가 왜 데이터 분석에 유용한지 알아보았다. 내장 함수의 기능도 훌륭하지만, 때로는 나만의 함수를 만들어 데이터 처리에 사용하는 것이 더 편리할 수도 있기 때문에 apply 메서드의 사용법은 반드시 알아두어야 한다.